Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་རྣམས་ལས་ཅི་ལྟ་བ་བཞིན་དུ་འགྲོ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Fully aware of their actions, he is fully aware of their destinations.

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ་ཡིན། ལོག་པར་ལྟ་བ་ཡིན་ཏེ། ལོག་པར་ལྟ་བའི་ལས་དང་ཆོས་ཡང་དག་པར་བླངས་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེས་ན་ལུས་དང་བྲལ་ཏེ། ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: “He sees that when they separate from their bodies at death—by cause and condition of adopting the wrong teachings and actions—those who comport themselves wrongly, those who speak wrongly, those who reflect wrongly, those who hurl insults at the noble ones, and those who hold wrong views will fall to lower realms and take rebirth as hell beings.

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། འཕགས་པ་རྣམས་ལ་སྐུར་པ་མི་འདེབས་པ་ཡིན། ཡང་དག་པར་ལྟ་བ་ཡིན་ཏེ། ཡང་དག་པར་ལྟ་བའི་ལས་དང་ཆོས་ཡང་དག་པར་བླངས་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེས་ལུས་དང་བྲལ་ཏེ། ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་བ་མཐོང་ངོ་། །
en: And he sees that when they separate from their bodies at death—by cause and condition of adopting the right teachings and actions—those who comport themselves rightly, those who speak rightly, those who reflect rightly, those who refrain from hurling insults at the noble ones, and those who hold right views will travel to happy migrations and take rebirth among gods in the heavens.

source: དགེ་སློང་དག་ངས་ནི་ཚེ་འདི་ཉིད་ལ་ཟག་པ་རྣམས་ཟད་པས།
en: “Monks, in this very life I have exhausted the outflows.

source: ཟག་པ་མེད་པའི་སེམས་རྣམ་པར་གྲོལ་བ་དང་ཤེས་རབ་རྣམ་པར་གྲོལ་བ། རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ཏེབསྒྲུབས་ནས་བདག་གི་སྐྱེ་བ་ནི་ཟད་དོ། །
en: My mind, thus free of outflows, has been liberated, wisdom has been liberated, and having directly realized and accomplished this through my own superknowledge, rebirth is extinguished for me.

source: ཚངས་པར་སྤྱོད་པ་ནི་སྤྱད་ཟིན་ཏོ། །
en: I have lived the holy life,

source: བྱ་བ་ནི་བྱས་སོ། །
en: I have done what was before me,

source: འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་སྙམ་དུ་ཉམས་སུ་མྱོང་ངོ་། །
en: and I understand that I shall know no other existence.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་གིས་ཀྱང་ཚེ་འདི་ཉིད་ལ་ཟག་པ་རྣམས་ཟད་པས།
en: “Monks, in this very life the monk Kāśyapa has also exhausted the outflows.

source: ཟག་པ་མེད་པའི་སེམས་རྣམ་པར་གྲོལ་བ་དང་ཤེས་རབ་རྣམ་པར་གྲོལ་བ། རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ཏེ་བསྒྲུབས་ནསབདག་གི་སྐྱེ་བ་ནི་ཟད་དོ། །
en: His mind, thus free of outflows, has been liberated, wisdom has been liberated, and having directly realized this though his own superknowledge, rebirth is extinguished for him.

source: དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་ནང་དུ་བདག་ཉིད་དང་འདྲ་བར་ཆེ་བ་དང་རྒྱ་ཆེ་བ་ལ་བཞག་པ་དེའི་ཚེ། ལྷག་པར་ཡང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་བླ་མར་གྱུར་ཏོ། །
en: As the Blessed One, there amid hundreds of disciples, affirmed Venerable Mahā­kāśyapa’s greatness as being like his own, he made him supreme guru of the entire world with its gods.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་གང་གི་ཚེ། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་བདག་ཉིད་དང་འདྲ་བར་ཆེ་བ་དང་རྒྱ་ཆེ་བ་ལ་བཞག་པ། དེའི་ཚེ་ལྷག་པར་ཡང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་བླ་མར་གྱུར་པ་ལ་གཟིགས།
en: “Lord,” the monks requested the Blessed Buddha, “tell us why the Blessed One affirmed the vast greatness of Venerable Mahā­kāśyapa as being like his own, making him guru of all the entire world with its gods.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། ཇི་ལྟར་འདས་པའི་དུས་ན་ཡང་། གང་གི་ཚེ་ངས་འདི་ལ་བཀུར་སྟི་བྱས་པ་དེའི་ཚེ། ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཀྱི་བླ་མར་གྱུར་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, when I venerated him, he became the guru of all of the many people living in this realm. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, in times past, during King Brahmadatta’s reign in the city of Vārāṇasī,

source: དེའི་རིང་ལ་འབྱོར་པ་དང་རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་དང་རྩོད་པ་དང་འཐབ་པ་ཞི་བ་དང་འཁྲུག་པ་དང་ནང་འཁྲུག་དང་ཆོམ་རྐུན་པ་དང་ནད་དང་མུ་གེ་མེད་པ་དང་འབྲས་སཱ་ལུ་དང་བུ་རམ་ཤིང་དང་བ་ལང་དང་མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: the kingdom was prosperous, flourishing, happy, and well populated. The harvest was good. Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine. Rice, sugarcane, cattle, and buffalo were plentiful.

source: གནོད་པ་མེད་ཅིང་ཚེར་མ་དཀྲུགས་ལ། བུ་གཅིག་པ་སྡུག་པ་ལ་བྱ་བ་བཞིན་དུ་རྒྱལ་སྲིད་བྱས་སོ། །
en: King Brahmadatta did no harm, and he ruled the kingdom gently and mercifully, as a parent cares for a beloved only child.

source: རྒྱལ་པོ་དེ་ལ་བཙུན་མོ་མང་སྟེ་བཙུན་མོ་ལྔ་བརྒྱ་ཡོད་དོ། །
en: “The king had as many as five hundred queens.

source: དེ་དག་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་ཀྱང་བུ་མེད་ནས།
en: Though they all enjoyed themselves and coupled, they had no children.

source: བུ་འདོད་དེ་ལྷ་འོ་ཅོག་ལ་གསོལ་བ་འདེབས་སོ། །
en: Wishing for an heir he supplicated every possible deity,

source: དེ་གསོལ་བ་འདེབས་པ་ལྷུར་བྱེད་ཀྱང་བུ་ཡང་མ་སྐྱེས། བུ་མོ་ཡང་མ་སྐྱེས་སོ། །
en: but despite his earnest supplications neither son nor daughter was born.

source: རྒྱལ་པོ་དེ་ལ། བློན་པོ་ལྔ་བརྒྱ་ཡོད་ན་ཐམས་ཅད་ཀྱང་རྒྱགས་ཤིང་བག་མེད་པར་གནས་པ་ཤ་སྟག་གོ། །
en: “The king had five hundred ministers, every one of them arrogant and imprudent.

source: དེའི་བློན་པོའི་མཆོག་མཛོད་ཅེས་བྱ་བ་མཁས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ་གཞུང་ལུགས་ཅན་དུལ་བ་དང་ལྡན་པ་བག་ཡོད་པ་ཞིག་ཀྱང་ཡོད་དོ། །
en: But his chief minister, whose name was Treasure , was capable, clear-minded, shrewd, disciplined, and prudent.

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན། ཉི་འོག་གི་རྒྱལ་པོ་ཞིག་དང་མི་འཐུན་པར་གྱུར་ནས། རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་བསམས་པ།
en: “King Brahmadatta had a disagreement with a certain neighboring king, so he thought,

source: བདག་གིས་བློན་པོ་གང་ཉི་འོག་གི་ཡུལ་དེར་བཞག་ན། རྒྱལ་པོ་དེ་དང་མཇལ་དུམ་བྱས་ནས། ཡུལ་སྲུང་ནུས་པར་འགྱུར་ཞིག་གུ་སྙམ་མོ། །
en: ‘Which minister can I send to that neighboring country who will be able to form a truce with its king and safeguard my country?’

source: དེ་ནས་དེས་བལྟས་ན་བློན་པོའི་མཆོག་མཛོད་ཅེས་བྱ་བ། མཁས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ། གཞུང་ལུགས་ཅན་དུལ་བ་དང་ལྡན་པ།
en: “When the king pondered this, he saw that his chief minister Treasure was capable, clear-minded, shrewd, disciplined, and prudent.

source: བག་ཡོད་པ་ཞིག་འདུག་པ་དེས་རྒྱལ་པོ་དེ་དང་མཇལ་དུམ་བྱས་ནསབདག་གི་ཡུལ་སྲུང་ནུས་པར་འགྱུར་རོ་སྙམ་ནས།
en: ‘He can form a truce with that king and safeguard my country,’ the king thought.

source: རྒྱལ་པོ་དེས་དེ་མཐའ་འཁོབ་རི་ཁྲོད་ཀྱི་ཡུལ་དེར་བསྐོས་ཏེ།
en: The king appointed him to a post among the surrounding mountains and told him:

source: ཁྱོད་སོང་ལ་དེར་འདུག་སྟེ་ངའི་ཡུལ་སྲུངས་ཤིག །
en: ‘Go, stay there, and safeguard the country.’

source: ལྷས་ཇི་སྐད་བཀའ་སྩལ་པ་བཞིན་དུ་འཚལ་ལོ་ཞེས་སྨྲས་ནས།
en: “ ‘As you wish, Deva,’ he replied.

source: དེ་རི་ཁྲོད་དེར་སོང་ནས་འདུག་གོ། །
en: He went out among the mountains, and there he stayed.

source: དེ་དེར་སོང་ནས་ཀྱང་ཉི་འོག་གི་ཡུལ་དེ་བཟུང་ནས། ཅི་ནས་ཡུལ་དེར་གནོད་པ་ཅུང་ཟད་ཀྱང་བྱེད་མི་ནུས་པར་བྱས་སོ། །
en: After he got there and had assumed control of the neighboring territory, no harm befell the country at all.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་རྒས་པའི་འོག་ཏུ་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: “One day, after King Brahmadatta had grown old, one of his wives conceived.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་རིགས་དང་མཐུན་པར་མིང་བཏགས་ཏེ།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: དེ་གང་གི་ཚེ་འགྲོ་ནུས་པར་གྱུར་པ་དེའི་ཚེ་རྒྱལ་པོ་སེམས་པ་ལ་ཞུགས་ཏེ།
en: Once he was able to walk, the king thought,

source: ད་ནི་བདག་རྒས་པས་རིང་པོ་མི་ཐོགས་པར་འཆི་བར་འགྱུར་ན།
en: ‘I’m old now, and it will not be long before I die.

source: བདག་འདས་པའི་འོག་ཏུ་བྱིས་པ་གཞོན་ནུ་འདིས། རྒྱལ་སྲིད་འཛིན་མི་ནུས་ན་
en: After I pass away, this child will not be able to rule the kingdom.

source: འདིས་ན་བདག་ཤི་བའི་འོག་ཏུ། བདག་གི་བློན་པོའི་ནང་ན་གང་ཞིག་གིས་བདག་གི་བུ་དང་རྒྱལ་སྲིད་སྲུང་ནུས་ཞིག་གུ་སྙམ་མོ། །
en: Who among my ministers can safeguard my child and my kingdom, then?’

source: དེ་ནས་དེས་བལྟས་ན་བློན་པོ་ལྔ་བརྒྱ་པོ་ཐམས་ཅད་ནི་རྒྱགས་ཤིང་བག་མེད་པར་གནས་ན། གཞན་སུ་ཡོད་སྙམ་སྟེ།
en: He pondered and recognized that every one of his five hundred ministers was arrogant and imprudent, and he wondered, ‘Who else is there?’

source: བརྟགས་ན་བློན་པོའི་མཆོག་མཛོད་ཅེས་བྱ་བ་མཁས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ་གཞུང་ལུགས་ཅན་དུལ་བ་དང་ལྡན་པ་བག་ཡོད་པ་དེས་ནི་བདག་འདས་པའི་འོག་ཏུ་བུ་དང་རྒྱལ་སྲིད་སྲུང་ནུས་སོ་སྙམ་མོ། །
en: “Upon examination he realized, ‘My chief minister Treasure is capable, clear-minded, shrewd, disciplined, and prudent. After I pass away he will be able to safeguard my child and my kingdom.’

source: བདག་གིས་ཅི་ནས་དེ་ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཀྱིས་བཀུར་བར་འགྱུར་བ་དེ་ལྟ་བུར་བཀུར་སྟི་བྱའོ་སྙམ་ནས་
en: ‘If I offer him my respect, all the many inhabitants of my country will respect him in the same way.’

source: རྒྱལ་པོ་དེས་དེ་ལ་ཕོ་ཉ་བཏང་སྟེ
en: So he sent a messenger to him, saying,

source: ང་ཁྱོད་དང་ཕྲད་པར་འདོད་ཀྱིས་ཤོག་ཅིག་ཅེས་སྤྲིང་ངོ་། །
en: ‘I wish to meet with you. Come quickly.’

source: དེ་ནས་བློན་པོའི་མཆོག་མཛོད་ཅེས་བྱ་བས་དེ་ཐོས་མ་ཐག་ཏུ་བཱ་རཱ་ཎ་སཱིར་ཆས་སོ། །
en: “As soon as he heard this, chief minister Treasure hurried to Vārāṇasī,

source: རྒྱལ་པོ་དེས་ཀྱང་དེ་ལ་བཀུར་སྟི་བྱ་བའི་ཕྱིར། ལམ་དང་གྲོང་ཁྱེར་མཛེས་པར་བྱེད་དུ་བཅུག་ནས་རྒྱལ་པོ་དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས།
en: where the king had the streets and houses beautified to show his respect. The king arrayed the four divisions of his army

source: རང་ཉིད་ཀྱིས་བློན་པོའི་མཆོག་མཛོད་ཅེས་བྱ་བ་བསུ་ནས།
en: and received chief minister Treasure in person.

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་བར་སྐབས་གང་དུ་དེ་དང་ཕྲད་པའི་བར་སྐབས་དེར། གླང་པོ་ཆེ་ལས་བབས་ནས་ཡང་དག་པར་དགའ་བར་བྱས་ཏེ།
en: When he greeted Treasure , King Brahmadatta descended from his elephant, and, beside himself with joy, put his arms around him.

source: མགུལ་ནས་འཇུས་ནས་བཞོན་པ་གཅིག་ལ་ཞོན་ཏེ། འབྱོར་པ་ཆེན་པོ་དང་ལྡན་པས་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱིར་སོང་ནས་
en: They rode a single mount, traveling to the city of Vārāṇasī in great opulence.

source: སྟན་གཅིག་ལ་འདུག་ཏུ་བཅུག་སྟེ་ཁ་ཟས་གཅིག་ཏུ་གཡོས་པ་དང་སྡེར་གཅིག་ཏུ་ཟན་ཟོས་ནས་
en: “After he bade him sit together with him on a single seat, their food was prepared together and they ate from a single plate.

source: ནོར་གྱི་ཕུང་པོ་ཆེན་པོ་བྱིན་ནོ། །བྱིན་ནས་ཀྱང་རྒྱལ་པོ་དེས་དེ་ལ་སྨྲས་པ།
en: Then the king gave him a great mountain of wealth and said to him,

source: མཛོད་ད་ནི་ང་རྒས་ཏེ། རིང་པོར་མི་ཐོགས་པར་འཆི་བར་འགྱུར་ལ།
en: ‘O Treasure , I am old now, and it will not be long before I die.

source: བློན་པོ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ཀྱིས་ང་ཤི་བའི་འོག་ཏུ་རྒྱལ་པོ་བྱིས་པ་ཡིན་སྙམ་སྟེ། གཞོན་ནུ་ལ་བརྙས་པར་འགྱུར་དུ་འོང་ལ།
en: After my death, the five hundred ministers will all think, “This child is king?” and they will come to revile him.

source: ང་ཤི་བའི་འོག་ཏུ་ཁྱོད་ཀྱིས་བུ་དང་། རྒྱལ་སྲིད་སྲུང་ནུས་པས་ན་ངས་ཁྱོད་ལ་བུ་དང་རྒྱལ་སྲིད་གཏད་ཀྱིས། ང་ཤི་བའི་འོག་ཏུ་འདི་གཉིས་བསྲུང་བར་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: After my death you will be able to safeguard my son and my kingdom. Therefore, I entrust my son and kingdom to you. Safeguard them after my death!’

source: བློན་པོའི་མཆོག་མཛོད་ཀྱིས་གསོལ་པ། ལྷས་ཇི་སྐད་བཀའ་སྩལ་པ་བཞིན་དུ་འཚལ་ལོ། །
en: “ ‘As you wish, Deva,’ replied the chief minister Treasure.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་བྱིན་ནད་ཀྱིས་ཐེབས་ནས།
en: “One day King Brahmadatta fell ill.

source: དེ་རྩ་བ་དང་སྡོང་བུ་དང་ལོ་མ་དང་མེ་ཏོག་དང་འབྲས་བུའི་སྨན་རྣམས་ཀྱིས་རིམ་གྲོ་བྱས་ཀྱང་སོས་པར་བྱེད་མ་ནུས་ནས། དེས་རྒྱལ་བུ་རྒྱལ་སར་བཅུག་སྟེ། བློན་པོའི་མཆོག་མཛོད་ལ་གཏད་ནས་ཤི་བའི་འོག་ཏུ་རྒྱལ་པོའི་བུ་དང་ཡུལ་བསྲུངས་ནས་ཕྱོགས་སུ་བསྒྲགས་སོ། །
en: Though he was treated with medicinal roots, stems, leaves, flowers, and fruits, he could not be cured so he ceded the throne to the prince, entrusted both to the chief minister Treasure , and proclaimed that after his death, it was he who would safeguard his son and his kingdom.

source: དེ་ནས་དེས་རྒྱལ་པོ་བགྲེས་པོ་ཤི་བའི་འོག་ཏུ། དེས་དེའི་འདབ་བཏང་ནས་བློན་པོ་ལྔ་བརྒྱ་པོ་བསྡུས་ཏེ་བསྒོ་བ།
en: “After the elder king died, the chief minister Treasure dispatched his retinue, summoned the five hundred ministers, and told them,

source: ཁྱོད་ཇི་ལྟར་ཡང་རྒྱལ་པོ་བགྲེས་པོ་ནོངས་པས་གཞན་སུ་ཡང་བདག་ཅག་སྡུད་པ་མེད་དོ་སྙམ་དུ་མ་སེམས་ཤིག །
en: ‘I say to all of you, it may be that the elder king has died, but you should not think there is no one to unify us.

source: ངས་ཁྱེད་ཀུན་ལ་ཡུལ་གྱི་བགོ་བཤའ་བྱའོ། །
en: I shall grant each of you a portion of the country.

source: བདག་ཅག་གིས་ཅི་ནས་རྒྱལ་པོ་འདི་བྱིས་པ་ཡིན་ཡང་སུས་ཀྱང་མི་ཚུགས་པར་བྱའོ་ཞེས་བྱས་ནས།
en: We must make certain that this young king is not harmed by anyone.’

source: དེས་བློན་པོ་ལྔ་བརྒྱ་པོ་དེ་དག་ལ་ཡུལ་གྱི་བགོ་བཤའ་བྱས་སོ། །
en: “He granted a portion of the country to each of the five hundred ministers,

source: རྒྱལ་པོའི་བུ་དེ་ཡང་ནང་མི་དང་བཅས་པར་དེ་ཉིད་ཀྱིས་བསྲུངས་སོ། །
en: and safeguarded both the prince and his family.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། བློན་པོའི་མཆོག་མཛོད་ཀྱིས་གསོལ་པ།
en: When the prince had grown, the chief minister Treasure told him,

source: ལྷ་རྒྱལ་པོ་ཡབ་ཀྱིས་ལྷ་དང་རྒྱལ་སྲིད་བདག་ལ་གཏད་ནས།
en: ‘Deva, your father, the king, entrusted you, Deva, and the kingdom to me.

source: ཡབ་ནོངས་པའི་འོག་ཏུ་བདག་གིས་ལྷ་དང་རྒྱལ་སྲིད་བསྲུངས་སོ་ཞེས་བྱས་སོ། །
en: After your father’s passing I safeguarded you, Deva, and the kingdom.’

source: དེའི་ཚེ་བློན་པོའི་མཆོག་མཛོད་ཅེས་བྱ་བར་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་ལྡན་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་འོད་སྲུང་འདི་ཁོ་ན་ཡིན་ཏེ
en: It is none other than Kāśyapa who was the chief minister Treasure then, and lived the life of a bodhisattva.

source: དེར་ཡང་གང་གི་ཚེ་ངས་བཀུར་སྟི་ཆེན་པོས་བཀུར་སྟི་བྱས་པ་དེའི་ཚེ། ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཀྱི་བླ་མར་གྱུར་ཏོ། །
en: At that time when I offered him my respect, he became the guru of all the many people who lived in this country.

source: ད་ལྟར་ཡང་གང་གི་ཚེ་ངས་འདི་ལ་བཀུར་སྟི་བྱས་ཏེ། བདག་ཉིད་དང་འདྲ་བར་ཆེ་བ་དང་རྒྱ་ཆེ་བ་ལ་བཞག་པ་དེའི་ཚེ་འདི་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བླ་མར་གྱུར་ཏོ།། །།
en: Now as well I have offered him my respect, and when I affirmed his vast greatness as being like my own, he became guru of all the world.”

source: ཀུན་དགའ་བོ་ཞེས་བྱ་བ་ནི།
en: A Story about Ānanda

source: གང་གི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་རབ་ཏུ་ཕྱུང་སྟེ། ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལོབས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་། ཐོས་པ་འཛིན་པ་རྣམས་དང་ཐོས་པ་བསགས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དང་།
en: After Venerable Ānanda had gone forth, he learned all 84,000 divisions of the Dharma, and the Blessed One commended him as foremost among keepers and compilers of the teachings.

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ཡང་། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཉིད་དང་འདྲ་བར་ཆེ་བ་དང་རྒྱ་ཆེ་བར་སྟོན་པ་དེའི་ཚེ། དེ་གཉི་ག་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་བླ་མར་གྱུར་ཏོ། །
en: The Blessed One also commended Mahā­kāśyapa’s vast greatness as being like his own. Thereupon they both became gurus of the entire world with its gods.

source: དགེ་སློང་འདི་ཉིད་ཀྱིས་ནི་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་བསྟན་པའི་དོན་བྱེད་ནུས་པར་འགྱུར་ཏེ།
en: “After my parinirvāṇa, these two monks will be able to fulfill the purpose of my teachings.

source: གཅིག་གིས་ནི་ཐོས་པའི་མཛོད་སྲུང་བར་ནུས་སོ། །
en: One will be able to safeguard the treasury of teachings,

source: གཅིག་གིས་ནི་བསྟན་པའི་དོན་བྱེད་ནུས་པར་འགྱུར་རོ་
en: and the other will be able to recount my doctrine.”

source: སྙམ་དུ་དགོངས་ནས། བཅོམ་ལྡན་འདས་ཀུ་ཤའི་གྲོང་ཁྱེར་དུ་ཆས་ཏེ་གཤེགས་སོ། །
en: Having reflected thus, the Blessed One traveled to the city of Kuśinagarī.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་ཚེ། འདི་སྙམ་དུ་དགོངས་ཏེ་
en: When the Blessed One was passing into parinirvāṇa he thought,

source: གལ་ཏེ་མི་རྣམས་འབའ་ཞིག་ལ་བསྟན་པ་གཏད་དེ། མི་མ་ཡིན་པ་རྣམས་ལ་མ་གཏད་ན་ཡང་ཡུན་རིང་དུ་གནས་པར་མི་འགྱུར་ལ།
en: “If I pass my doctrine on to only human beings and don’t pass it on to any nonhuman beings, it will not remain for long;

source: གལ་ཏེ་མི་མ་ཡིན་པ་རྣམས་འབའ་ཞིག་ལ་གཏད་དེ་མི་རྣམས་ལ་མ་གཏད་ན་ཡང་ཡུན་རིང་དུ་གནས་པར་མི་འགྱུར་གྱིས།
en: and if I pass it on to only nonhuman beings, and do not pass it on to any human beings, then it also will not remain for long.

source: མ་ལ་ངས་ལྷ་དང་མི་རྣམས་དང་དགེ་སློང་དེ་གཉིས་ལ་བསྟན་པ་གཏད་ན
en: So I will pass on my doctrine to gods and humans, and to both these monks as well,

source: ལྷ་དང་མི་རྣམས་ཀྱིས་ཀྱང་ཡོངས་སུ་གཟུང་ལ་དགེ་སློང་གཉིས་ཀྱིས་ཀྱང་ཡོངས་སུ་བཟུང་བས་བསྟན་པ་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ་
en: for then its keepers will be gods and human beings alike. Then, kept by gods, humans, and both these monks as well, the doctrine will remain for a long time.”

source: སྙམ་དུ་དགོངས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: Having reflected thus, the Blessed One said to Venerable Mahā­kāśyapa,

source: འོད་སྲུང་ཁྱོད་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བསྟན་པའི་དོན་བྱས་ཏེསྡེ་སྣོད་གསུམ་ཡང་དག་པར་བསྡུས་ནས་
en: “ Kāśyapa , after I pass into parinirvāṇa, you must not pass into parinirvāṇa until you have carried on my doctrine and perfectly recounted the Tripiṭaka,

source: དགེ་སློང་ཀུན་དགའ་བོས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་མ་བྱས་ཀྱི་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མ་བྱེད་ཅིག །
en: and the monk Ānanda has cast away all afflictive emotions and manifested arhatship.”

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱང་དྲང་སྲོང་ཉི་མའི་གུང་རབ་ཏུ་མ་བྱུང་གི་བར་དུ་མྱ་ངན་ལས་འདའ་བར་མ་བྱེད་ཅིག །
en: “Ānanda, do not pass into parinirvāṇa until the sage Mādhyandina has gone forth.

source: དེ་ལ་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་ཅེས་གྱིས་ཤིག །ཀླུའི་རྒྱལ་པོ། ཧུ་ལུ་རུ་བཏུལ་ཏེ།
en: Then you must tell him, ‘You must not pass into parinirvāṇa until you have tamed the nāga king Hulluru,

source: ཁ་ཆེའི་ཡུལ་བཙུགས་ནས་དེར་བསྟན་པ་གནས་པར་བྱས་ཏེ།
en: founded the kingdom of Kashmir, and established the doctrine there.

source: རྒྱས་པར་བྱས་ནས་དེ་བཞིན་དུ་ཁྱིམ་བདག་གསོ་མ་ཅན་རབ་ཏུ་ཕྱུང་སྟེ།
en: As it flourishes there the householder Śāṇavāsa will go forth.

source: དེས་ཀྱང་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ། དེ་ལ་ཁྱོད་ཀྱིས་ཐོས་པ་རྣམས་མ་གཏད་ཀྱི་བར་དུ་མྱ་ངན་ལས་འདའ་བར་མ་བྱེད་ཅིག །
en: You must not pass into parinirvāṇa until he has cast away all afflictive emotions and manifested arhatship, and you have passed on to him all that you have heard.’

source: གསོ་མ་ཅན་ལ་ཡང་འདི་སྐད་ཅེས་གྱིས་ཤིག །
en: “Then Mādhyandina must tell Śāṇavāsa,

source: ཁྱོད་ཀྱིས་ཀྱང་ཀླུའི་རྒྱལ་པོ་གར་མཁན་དང་དཔའ་བོ་གཉིས་བཏུལ་ཏེ།
en: ‘You must not pass into parinirvāṇa until you have tamed the two nāga kings Naṭa and Vīra,

source: གར་མཁན་དང་དཔའ་བོའི་དགོན་པའི་གནས་བཙུགས་ནས།
en: and they have established the hermitages of Naṭa and Vīra.

source: དེ་བཞིན་དུ་ཡུལ་བཅོམ་བརླག་ཏུ་སྤོས་འཚོང་སྲུང་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: There shall be a perfume merchant named Gupta in Mathurā,

source: དེའི་བུ་ཉེ་སྲུང་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་བ་དེ་རབ་ཏུ་ཕྱུང་ནས། དེས་ཀྱང་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས། དེ་ལ་ཡང་ཐོས་པ་རྣམས་མ་གཏད་ཀྱི་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མ་བྱེད་ཅིག །
en: and he will have a son named Upagupta. You must not pass into parinirvāṇa until he goes forth, casts away all afflictive emotions, manifests arhatship, and you have passed on to him all that you have heard.’

source: ཉེ་སྲུང་ལ་ཡང་འདི་སྐད་ཅེས་གྱིས་ཤིག །
en: “Then Śāṇavāsa must tell Upagupta,

source: ཁྱོད་ཀྱིས་ཀྱང་རིགས་ཀྱི་བུ་བློ་ལྡན་རབ་ཏུ་ཕྱུང་སྟེ་དེས་ཀྱང་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ། དེ་ལ་ཡང་ཐོས་པ་རྣམས་མ་གཏད་ཀྱི་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མ་བྱེད་ཅིག །
en: ‘You must not pass into parinirvāṇa until noble Dhītika has gone forth, manifested arhatship, and you have passed on to him all that you have heard.’

source: དེ་ལ་ཡང་འདི་སྐད་ཅེས་གྱིས་ཤིག །
en: “Upagupta must tell Dhītika,

source: ཁྱོད་ཀྱིས་ཀྱང་ཡུལ་དམར་ཅན་གྱི་བུ་ཞེས་བྱ་བར་ཟས་དུག་ཅན་གྱི་བསམ་པ་མ་བྱས་ཀྱི་བར་དུ། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མ་བྱེད་ཅིག་ཅེས་གྱིས་ཤིག་ཅེས་གསུངས་སོ། །
en: ‘You must not pass into parinirvāṇa until you decide to consume poisoned food in Pāṭaliputra.’ ”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Mahā­kāśyapa and Ānanda rose, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and said,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་བཀའ་སྩལ་པ་བཞིན་དུ་འཚལ་ལོ། །
en: “As you wish, Blessed One.”

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One spoke to Venerable Mahā­kāśyapa, saying,

source: འོད་སྲུང་ཁྱོད་སོང་ལ་སོ་སོ་སྐྱེ་བོའི་དགེ་འདུན་དག་ཁྲིད་དེ་ལྗོངས་རྒྱུ་ཞིང་སོང་ཤིག་
en: “ Kāśyapa , go now and lead the saṅgha of ordinary beings to wander the country.

source: ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་དེའི་སྔ་རོལ་ཏུ་འཁྲུག་ལོང་བྱེད་པར་མི་འགྱུར་བར་གྱིས་ཤིག །
en: Let there be no disagreement among you prior to my parinirvāṇa.”

source: གསོལ་པ། བཙུན་པ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་བྱས་ནས
en: “As you wish, Lord,” he replied,

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་སོ་སོ་སྐྱེ་བོའི་དགེ་འདུན་དག་ཁྲིད་དེ་ལྗོངས་རྒྱུ་ཞིང་སོང་ངོ་། །
en: and Venerable Mahā­kāśyapa went and led the saṅgha of ordinary beings to wander the country.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་སོང་ནས་རིང་པོ་མ་ལོན་པར། བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་དགོངས་པ་བསྐྱེད་དེ།
en: Not long after Venerable Mahā­kāśyapa had left, the Blessed One had a thought about the world:

source: ཀྱེ་མ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་ཡུལ་འཁོར་སྲུང་དང་འཕགས་སྐྱེས་པོ་དང་མིག་མི་བཟང་དང་རྣམ་ཐོས་ཀྱི་བུ་རྣམས་ང་ལ་ལྟར་འོངས་ན་ལེགས་སོ་སྙམ་དུ་དགོངས་ནས
en: “It would be good if Śakra, King of the Gods, and the four great kings—Dhṛtarāṣṭra, Virūpākṣa, Virūḍhaka, and Vaiśravaṇa—would come to see me.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་ལྷའི་ནང་ནས་མི་སྣང་བར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་པར་འགྱུར་བ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་སོ། །
en: So the Blessed One performed a miracle that caused Śakra, King of the Gods, and the four great kings to disappear from among the gods and appear instantly seated before the Blessed One.

source: དེ་ནས་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་གཏོར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དེ།
en: They scattered divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers over the Blessed One, and again sat down before him.

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་བཀའ་སྩལ་པ། དབང་པོ་དག་དེ་བཞིན་གཤེགས་པ་ནི་རིང་པོ་མི་ཐོགས་པར། ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་གྱིས།
en: “Lords,” the Blessed One said to Śakra, King of the Gods, and the four great kings, “before long the Tathāgata will pass into the realm of nirvāṇa without any remainder of the aggregates.

source: ང་ཡོངས་སུ་མྱ་ངན་འདས་པའི་འོག་ཏུ། ཁྱེད་ཀྱིས་བསྟན་པ་བསྲུང་བར་གྱིས་ཤིག །
en: After my parinirvāṇa, may you safeguard my doctrine.

source: དབང་པོ་དག་ལོ་སྟོང་འདས་པའི་འོག་ཏུ་བསྟན་པ་ནུབ་ཏུ་ཆ་བའི་ཚེ། འཇིག་རྟེན་ན་ཆོས་མ་ཡིན་པའི་ཤས་ཆེ་ཞིང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལས་ཡོངས་སུ་ཉམས་པར་གྱུར་པ་ན། འཛམ་བུའི་གླིང་དུ་མི་བདེ་བའི་རླུང་ལྡང་བར་འགྱུར་ཏེ།
en: “Lords, in a thousand years, when the doctrine has begun to decline, when injustice prevails in the world and the path of the ten virtuous actions has lost all its strength, Jambudvīpa will be filled with an ill wind.

source: མི་བདེ་བའི་རླུང་ལངས་པས་ཆར་འབབ་པར་མི་འགྱུར་རོ། །
en: With the arrival of this ill wind, rain will cease to fall.

source: ཆར་མ་བབ་པས་ཆུ་ཀླུང་དང་ཁྲོན་པ་རྣམས་ཆུ་ཉུང་བར་འགྱུར་ཞིང་ཤིང་ལྗོན་པ་རྣམས་ཀྱང་མེ་ཏོག་དང་འབྲས་བུ་མེད་པར་འགྱུར་རོ། །
en: When the rain ceases to fall, all the rivers and wells will have but little water in them. The trees will neither flower nor bear fruit,
